### 5.1.4.2 Advanced Manipulation of Pandas - Merge/Join/Concatenate:

__Overview:__
- Merging, Joining, and Concatenating using Pandas Dataframes are very useful, however, advanced for the beginner programmer
- However, the does not mean we can't explore the basics of what merging, joining, and concatenating is and how we can do it in Pandas 
- The full documentation for Merge, Join, and Concatenate can be found [here](http://pandas.pydata.org/pandas-docs/stable/merging.html)
- All 3 methods below, in their own way, describe the act of combining together Series and DataFrame objects with some logic to handle the indexes of the objects you are combining:
> 1. __Concatenating Objects:__ Concatenating objects in Pandas is done using the `concat` or the `append` function and you can think of this as "gluing together" multiple DataFrames or Series 
> 2. __Merging Objects:__ Merging objects in Pandas is done using the `merge` function and replicates [SQL Joins](https://en.wikipedia.org/wiki/Join_(SQL))
> 3. __Joining Objects:__ Joining objects in Pandas is done using the `join` function and can be used for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame

__Helpful Points:__
1. We actually have already concatenated DataFrames above when we added a new row to an existing DataFrame 
2. Remember that indexes are very important to DataFrames and most of the "logic" that these methods employ revolve around what to do with DataFrames/Series that have different indexes
3. SQL and Databases is definitely not required knowledge for this course, but further reading on Data Models (for your interest only) can be found [here](https://en.wikipedia.org/wiki/One-to-one_(data_model)) for __One-to-One Relationships__ and [here](https://en.wikipedia.org/wiki/Many-to-many_(data_model)) for __Many-to-Many Relationships__

__Practice:__ Examples of Advanced Manipulation of Pandas - Merge/Join/Concatenate in Python

#### Part 1 (Concatenating Objects):

In [1]:
import pandas as pd
# initialize 3 data frames to concatenate with same column names and index labels 
df1 = pd.DataFrame({'A': ['A0', 'A1'],
                    'B': ['B0', 'B1']},
                     index=[0, 1])
 
df2 = pd.DataFrame({'A': ['A2', 'A3'],
                    'B': ['B2', 'B3']},
                     index=[2, 3])

df3 = pd.DataFrame({'B': ['B2', 'B7'],
                    'F': ['F2', 'F3']},
                     index=[1, 5])

In [2]:
df1

    A   B
0  A0  B0
1  A1  B1

In [3]:
df2

    A   B
2  A2  B2
3  A3  B3

In [4]:
df3

    B   F
1  B2  F2
5  B7  F3

##### Example 1.1 (Concatenating 2 DataFrames with Different Indexes):

##### Example 1.1.1 (Using Concat):

In [5]:
result = pd.concat([df1, df2]) # concatenate one dataframe on another along rows 
result

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

##### Example 1.1.2 (Using Append):

In [6]:
a_result = df1.append(df2)
a_result

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

##### Example 1.2 (Concatenating 2 DataFrames with Same Indexes):

##### Example 1.2.1 (Using Concat):

In [7]:
# option 1 (finds unique columns, duplicates rows)
result = pd.concat([df1, df3], axis = 0) # concatenate one dataframe on another along rows
result

     A   B    F
0   A0  B0  NaN
1   A1  B1  NaN
1  NaN  B2   F2
5  NaN  B7   F3

In [8]:
# option 2 (finds unique rows, duplicates columns)
result_1 = pd.concat([df1, df3], axis = 1) # concatenate one dataframe on another along columns
result_1

     A    B    B    F
0   A0   B0  NaN  NaN
1   A1   B1   B2   F2
5  NaN  NaN   B7   F3

In [9]:
# option 3 (uses only index from df1)
result_2 = pd.concat([df1, df3], axis = 1, join_axes=[df1.index]) # concatenate one dataframe on another along columns
result_2

    A   B    B    F
0  A0  B0  NaN  NaN
1  A1  B1   B2   F2

In [10]:
# option 4 (ignores and resets index)
result_3 = pd.concat([df1, df3], ignore_index = True) # same as option 1 but with reset index 
result_3

     A   B    F
0   A0  B0  NaN
1   A1  B1  NaN
2  NaN  B2   F2
3  NaN  B7   F3

##### Example 1.2.2 (Using Append):

In [11]:
a_result_1 = df1.append([df3]) # same as option 1 above
a_result_1

     A   B    F
0   A0  B0  NaN
1   A1  B1  NaN
1  NaN  B2   F2
5  NaN  B7   F3

In [12]:
a_result_2 = df1.append([df3], ignore_index = True) # same as option 4 above
a_result_2

     A   B    F
0   A0  B0  NaN
1   A1  B1  NaN
2  NaN  B2   F2
3  NaN  B7   F3

#### Part 2 (Merging Objects):

In [13]:
raw_data_1 = {
        'mathdad_id': ['1', '2', '3'],
        'first_name': ['Carl', 'Heliocat', 'Bernie'], 
        'last_name': ['Gauss', 'Euler', 'Riemann']}
df_a = pd.DataFrame(raw_data_1, columns = ['mathdad_id', 'first_name', 'last_name'])

raw_data_2 = {
        'mathdad_id': ['2', '3', '4'],
        'first_name': ['Ray Ray', 'Willy "Tall Hairs"', 'Andrew'], 
        'last_name': ['Descartes', 'Leibniz', 'Wiles']}
df_b = pd.DataFrame(raw_data_2, columns = ['mathdad_id', 'first_name', 'last_name'])

raw_data_3 = {
        'mathdad_id': ['1', '2', '3', '4'],
        'skill_level': ['12', '24', '13', '4']}
df_c = pd.DataFrame(raw_data_3, columns = ['mathdad_id', 'skill_level'])

In [14]:
df_a

  mathdad_id first_name last_name
0          1       Carl     Gauss
1          2   Heliocat     Euler
2          3     Bernie   Riemann

In [15]:
df_b

  mathdad_id          first_name  last_name
0          2             Ray Ray  Descartes
1          3  Willy "Tall Hairs"    Leibniz
2          4              Andrew      Wiles

In [16]:
df_c

  mathdad_id skill_level
0          1          12
1          2          24
2          3          13
3          4           4

##### Example 2.1 (Merge DataFrames - Method 1):

In [17]:
pd.merge(pd.concat([df_a, df_b]), df_c, on = "mathdad_id") # concatenate 2 mathdad df and then merge with skill level df

  mathdad_id          first_name  last_name skill_level
0          1                Carl      Gauss          12
1          2            Heliocat      Euler          24
2          2             Ray Ray  Descartes          24
3          3              Bernie    Riemann          13
4          3  Willy "Tall Hairs"    Leibniz          13
5          4              Andrew      Wiles           4

In [18]:
pd.merge(pd.concat([df_a, df_b]), df_c, left_on = "mathdad_id", right_on = "mathdad_id") # same as above

  mathdad_id          first_name  last_name skill_level
0          1                Carl      Gauss          12
1          2            Heliocat      Euler          24
2          2             Ray Ray  Descartes          24
3          3              Bernie    Riemann          13
4          3  Willy "Tall Hairs"    Leibniz          13
5          4              Andrew      Wiles           4

##### Example 2.2 (Merge DataFrames - Method 2):

In [19]:
pd.merge(df_a, df_b, right_index = True, left_index = True) # merge based on indexes

,mathdad_id_x,first_name_x,last_name_x,mathdad_id_y,first_name_y,last_name_y
0,1,Carl,Gauss,2,Ray Ray,Descartes
1,2,Heliocat,Euler,3,"Willy ""Tall Hairs""",Leibniz
2,3,Bernie,Riemann,4,Andrew,Wiles

##### Example 2.3 (Merge DataFrames - Method 3):

__[Outer Join](https://blog.codinghorror.com/a-visual-explanation-of-sql-joins/):__ “Full outer join produces the set of all records in Table A and Table B, with matching records from both sides where available. If there is no match, the missing side will contain null.”

- Don't worry about the terminology and definition, this is just for your reference. Just keep this method in your "toolkit" in the event that one of your use cases demands that your result is as appears below

In [20]:
pd.merge(df_a, df_b, on='mathdad_id', how='outer')

  mathdad_id first_name_x last_name_x        first_name_y last_name_y
0          1         Carl       Gauss                 NaN         NaN
1          2     Heliocat       Euler             Ray Ray   Descartes
2          3       Bernie     Riemann  Willy "Tall Hairs"     Leibniz
3          4          NaN         NaN              Andrew       Wiles

##### Example 2.4 (Merge DataFrames - Method 4):

__[Inner Join](https://blog.codinghorror.com/a-visual-explanation-of-sql-joins/):__ “Inner join produces only the set of records that match in both Table A and Table B.”

- Don't worry about the terminology and definition, this is just for your reference. Just keep this method in your "toolkit" in the event that one of your use cases demands that your result is as appears below

In [21]:
pd.merge(df_a, df_b, on='mathdad_id', how='inner')

  mathdad_id first_name_x last_name_x        first_name_y last_name_y
0          2     Heliocat       Euler             Ray Ray   Descartes
1          3       Bernie     Riemann  Willy "Tall Hairs"     Leibniz

##### Example 2.5 (Merge DataFrames - Method 5):

__[Left Join](https://blog.codinghorror.com/a-visual-explanation-of-sql-joins/):__ "Left outer join produces a complete set of records from Table A, with the matching records (where available) in Table B. If there is no match, the right side will contain null.”

- Don't worry about the terminology and definition, this is just for your reference. Just keep this method in your "toolkit" in the event that one of your use cases demands that your result is as appears below

In [22]:
pd.merge(df_a, df_b, on='mathdad_id', how='left')

  mathdad_id first_name_x last_name_x        first_name_y last_name_y
0          1         Carl       Gauss                 NaN         NaN
1          2     Heliocat       Euler             Ray Ray   Descartes
2          3       Bernie     Riemann  Willy "Tall Hairs"     Leibniz

##### Example 2.6 (Merge DataFrames - Method 6):

__[Right Join](https://en.wikipedia.org/wiki/Relational_algebra#Right_outer_join_(%E2%9F%96):__ "Right outer join produces a complete set of records from Table B, with the matching records (where available) in Table A. If there is no match, the right side will contain null.”

- Don't worry about the terminology and definition, this is just for your reference. Just keep this method in your "toolkit" in the event that one of your use cases demands that your result is as appears below

In [23]:
pd.merge(df_a, df_b, on='mathdad_id', how='right')

  mathdad_id first_name_x last_name_x        first_name_y last_name_y
0          2     Heliocat       Euler             Ray Ray   Descartes
1          3       Bernie     Riemann  Willy "Tall Hairs"     Leibniz
2          4          NaN         NaN              Andrew       Wiles

#### Part 3 (Joining DataFrames):

In [24]:
raw_data_1 = {
        'first_name': ['Allen', 'Ryan', 'Joshua'],
        'last_name': ['Hart', 'Hart', 'Lee']}
df_a = pd.DataFrame(raw_data_1, index = ['employee_1', 'employee_2', 'employee_3'])

raw_data_1 = {
        'department_id': ['1', '2', '2'],
        'team_id': ['3', '3', '3']}
df_b = pd.DataFrame(raw_data_1, index = ['employee_1', 'employee_3', 'employee_4'])

In [25]:
df_a

           first_name last_name
employee_1      Allen      Hart
employee_2       Ryan      Hart
employee_3     Joshua       Lee

In [26]:
df_b

           department_id team_id
employee_1             1       3
employee_3             2       3
employee_4             2       3

##### Example 3.1 (Method 1):

In [27]:
df_a.join(df_b)

           first_name last_name department_id team_id
employee_1      Allen      Hart             1       3
employee_2       Ryan      Hart           NaN     NaN
employee_3     Joshua       Lee             2       3

In [28]:
df_a.join(df_b, how = "left") # same as above (default)

           first_name last_name department_id team_id
employee_1      Allen      Hart             1       3
employee_2       Ryan      Hart           NaN     NaN
employee_3     Joshua       Lee             2       3

##### Example 3.2 (Method 2):

In [29]:
df_a.join(df_b, how = "right") # right join (see above for definition)

           first_name last_name department_id team_id
employee_1      Allen      Hart             1       3
employee_3     Joshua       Lee             2       3
employee_4        NaN       NaN             2       3

##### Example 3.3 (Method 3):

In [30]:
df_a.join(df_b, how = "outer") # outer join (see above for definition)

           first_name last_name department_id team_id
employee_1      Allen      Hart             1       3
employee_2       Ryan      Hart           NaN     NaN
employee_3     Joshua       Lee             2       3
employee_4        NaN       NaN             2       3

##### Example 3.4 (Method 4):

In [31]:
df_a.join(df_b, how = "inner") # inner join (see above for definition)

           first_name last_name department_id team_id
employee_1      Allen      Hart             1       3
employee_3     Joshua       Lee             2       3

##### Example 3.5 (Method 5):

In [32]:
df_a.join(df_b, lsuffix = "_l", rsuffix = "_r") # overlapping columns

           first_name last_name department_id team_id
employee_1      Allen      Hart             1       3
employee_2       Ryan      Hart           NaN     NaN
employee_3     Joshua       Lee             2       3

##### Example 3.6 (Method 6):

In [33]:
raw_data_1 = {
        'first_name': ['Allen', 'Ryan', 'Joshua'],
        'last_name': ['Hart', 'Hart', 'Lee'],
        'employee_num': ["employee_1", "employee_2", "employee_3"]}
df_a = pd.DataFrame(raw_data_1, index = ['employee_1', 'employee_2', 'employee_3'])

raw_data_1 = {
        'department_id': ['1', '2', '2'],
        'team_id': ['3', '3', '3']}
df_b = pd.DataFrame(raw_data_1, index = ['employee_1', 'employee_3', 'employee_4'])

In [34]:
df_a

           employee_num first_name last_name
employee_1   employee_1      Allen      Hart
employee_2   employee_2       Ryan      Hart
employee_3   employee_3     Joshua       Lee

In [35]:
df_b

           department_id team_id
employee_1             1       3
employee_3             2       3
employee_4             2       3

In [36]:
df_a.join(df_b, on = "employee_num") # join on index and column

           employee_num first_name last_name department_id team_id
employee_1   employee_1      Allen      Hart             1       3
employee_2   employee_2       Ryan      Hart           NaN     NaN
employee_3   employee_3     Joshua       Lee             2       3

### 5.1.4.3 Advanced Manipulation of Pandas - Reshaping and Pivot Tables:

__Overview:__
- It is common as a Data Scientist to work with data that is stored in CSV files or databases in "stacked" format (i.e. information for multiple groups stacked on top of each other)
- However, it is inconvenient to perform analysis on stacked data, and much easier to work with data that is grouped by category or some other variable
- In Excel, the __["Pivot Table"](https://support.office.com/en-us/article/create-a-pivottable-to-analyze-worksheet-data-a9a84538-bfe9-40a9-a8e9-f99134456576)__ offers a helpful way to "unstack" stacked data in a format that is conducive for analysis
- Pandas has very similar methods for "pivoting/reshaping" data that can be found [here](http://pandas.pydata.org/pandas-docs/stable/reshaping.html):
> 1. Reshaping by __Pivoting DataFrame Objects:__ This reshaping can be done using the `pivot` function. The primary purpose here is to make the `columns` the unique variables and the `index` the time frame or identifier
> 2. Reshaping by __Melting DataFrame Objects:__ This reshaping can be done using the `melt` function. The primary purpose here is to make one or more columns identifier variables and the other columns measured variables which are "unpivoted" to the row axis
> 3. Reshaping by __Pivot Tables:__ This reshaping can be done using the `pivot_table` function. The primary purpose here is to pivot data AND provide aggregation of numeric data 

__Helpful Points:__
1. Most people coming into Data Science have some experince with Excel, so these operations may feel "at home" for them
2. Note the difference between the `pivot` and `pivot_table` functions. The former is used for general purpose pivoting of DataFrames and the latter is used for pivoting with aggregation of numeric data 

__Practice:__ Examples of Advanced Manipulation of Pandas - Reshaping and Pivot Tables in Python

#### Part 1 (Reshaping by Pivoting DataFrame Objects):

In [37]:
### Make some data to work with:

values = [{"Day":"Monday", "Buyer":"Mom", "Type":"Fuel", "Amount":45},
         {"Day":"Tuesday", "Buyer":"Dad", "Type":"Food", "Amount":200},
         {"Day":"Tuesday", "Buyer":"Allen", "Type":"Sports", "Amount":100},
         {"Day":"Monday", "Buyer":"Ryan", "Type":"Music", "Amount":90}]
expenses_df = pd.DataFrame(values, columns = ["Day", "Buyer", "Type", "Amount"])
expenses_df

       Day  Buyer    Type  Amount
0   Monday    Mom    Fuel      45
1  Tuesday    Dad    Food     200
2  Tuesday  Allen  Sports     100
3   Monday   Ryan   Music      90

##### Example 1.1 (Pivot by Day and Buyer):

In [38]:
expenses_df.pivot(index = "Day", columns = "Buyer", values = "Amount")

Buyer    Allen    Dad   Mom  Ryan
Day
Monday     NaN    NaN  45.0  90.0
Tuesday  100.0  200.0   NaN   NaN

##### Example 1.2 (Pivot by Buyer and Type):

In [39]:
expenses_df.pivot(index = "Type", columns = "Buyer", values = "Amount")

Buyer   Allen    Dad   Mom  Ryan
Type
Food      NaN  200.0   NaN   NaN
Fuel      NaN    NaN  45.0   NaN
Music     NaN    NaN   NaN  90.0
Sports  100.0    NaN   NaN   NaN

__NOTE:__ As we can see, these methods are graceful, but not particularly helpful with non-numeric data. A solution to this could be a dictionary key with numeric values that correstpond to different types of expenses. We could also get creative with the `.melt()` method...

#### Part 2 (Reshaping by Melting DataFrame Objects):

##### Example 2.1 (Melt by Type):

In [40]:
# subset for only type 
expenses_df.melt(id_vars = ["Day", "Buyer"], value_vars = ["Type"])

       Day  Buyer variable   value
0   Monday    Mom     Type    Fuel
1  Tuesday    Dad     Type    Food
2  Tuesday  Allen     Type  Sports
3   Monday   Ryan     Type   Music

##### Example 2.2 (Melt by Amount):

In [41]:
# subset for only amount
expenses_df.melt(id_vars = ["Day", "Buyer"], value_vars = ["Amount"])

       Day  Buyer variable  value
0   Monday    Mom   Amount     45
1  Tuesday    Dad   Amount    200
2  Tuesday  Allen   Amount    100
3   Monday   Ryan   Amount     90

#### Part 3 (Reshaping by Pivot Tables):

In [42]:
values = [{"Day":"Monday", "Buyer":"Mom", "Type":"Fuel", "Amount":45},
         {"Day":"Tuesday", "Buyer":"Dad", "Type":"Food", "Amount":200},
         {"Day":"Tuesday", "Buyer":"Allen", "Type":"Sports", "Amount":100},
         {"Day":"Monday", "Buyer":"Ryan", "Type":"Music", "Amount":90},
         {"Day":"Monday", "Buyer":"Allen", "Type":"Snacks", "Amount":2000}]
expenses_df = pd.DataFrame(values, columns = ["Day", "Buyer", "Type", "Amount"])
expenses_df

       Day  Buyer    Type  Amount
0   Monday    Mom    Fuel      45
1  Tuesday    Dad    Food     200
2  Tuesday  Allen  Sports     100
3   Monday   Ryan   Music      90
4   Monday  Allen  Snacks    2000

##### Example 3.1 (Pivot Table 1 - Aggregate Amount by Buyer):

In [43]:
### dont forget to import numpy
import numpy as np

In [44]:
pd.pivot_table(expenses_df, values = "Amount", index = "Buyer", aggfunc = np.sum)

       Amount
Buyer
Allen    2100
Dad       200
Mom        45
Ryan       90

##### Example 3.2 (Pivot Table 1 - Aggregate Amount by Day):

In [45]:
### Let's drop that silly row with huge snack expenses

expenses_df.drop(expenses_df.index[-1], inplace = True)
expenses_df

       Day  Buyer    Type  Amount
0   Monday    Mom    Fuel      45
1  Tuesday    Dad    Food     200
2  Tuesday  Allen  Sports     100
3   Monday   Ryan   Music      90

In [46]:
pd.pivot_table(expenses_df, values = "Amount", index = "Day", aggfunc = np.sum)

         Amount
Day
Monday      135
Tuesday     300

### 5.1.4.4 Advanced Manipulation of Pandas - GroupBy:

### 5.1.4.4.1 Introduction to GroupBy:

__Overview:__
- The GroupBy functionality draws from the common "Split-Apply-Combine" strategy which is summarized below:
> 1. __Split:__  The split step involves splitting the data into groups based on some criteria
> 2. __Apply:__ The apply step involves applying a function to each group independently. The functions applied in this step fall in 3 main categories:
>> a. __Aggregation:__ The aggregation functions compute a summary statistic about each group (i.e. group sums, means, sizes, counts, etc.)<br>
>> b. __Transformation:__ The transformation functions perform some group-specific computations on each group (i.e. standardize data within each group, fill NAs within groups, etc.)<br>
>> c. __Filtration:__ The filtration functions discard some groups according to a group-wise computation (i.e. discard data that belongs to groups with only a few members, filter out data based on group sum or mean, etc.)<br>
> 3. __Combine:__ The combine step involves combining the results into a data structure 

__Helpful Points:__
1. The GroupBy functionality exists in the SQL command `GROUP BY` which you can read about it [here](https://dev.mysql.com/doc/refman/5.7/en/group-by-modifiers.html) and [here](https://docs.microsoft.com/en-us/sql/t-sql/queries/select-group-by-transact-sql) if you are interested 
2. Arguably the most common functionality for Data Scientists is "GroupBy-Aggregation"

### 5.1.4.4.2 GroupBy in Pandas:

__Overview:__
- The __[GroupBy](http://pandas.pydata.org/pandas-docs/stable/groupby.html)__ function in Pandas allows us to perform the "split-apply-combine" strategy in a very efficient manner
- The procedure is performed in the following steps where the "combine" step is implicit in the "apply" step:

> /1. __STEP 1 (SPLIT):__ Splitting is completed by creating a "GroupBy" object which basically just means separating out the data into constituent groups. GroupBy objects can be created in the following way: 
>> a. `grouped = obj.groupby(key)`<br>
>> b. `grouped = obj.groupby(key, axis=1)`<br>
>> c. `grouped = obj.groupby([key1, key2])`
>> - Here, the `obj` is usually a Pandas `DataFrame` object and the `key` is most commonly one of the following:<br>
>> > a. List or NumPy array<br> 
>> > b. Dictionary or Series<br>
>> > c. Column name<br>
>> - In practice, the "group keys" will refer to the labels of each group (i.e. "A" and "B" are the group keys for Group "A" and Group "B" and "Group" would be passed as the `key` argument into the `groupby` function) 

> /2. __STEP 2 (APPLY):__ Now that a GroupBy object has been created, we can perform various "apply" methods to the object such as:
>> a. __Aggregation:__ Aggregation returns a new DataFrame and can be completed in this fashion: `grouped.agg` or `grouped.aggregate`<br>
>> b. __Transformation:__ Transformation returns an object that is indexed the same as the one begin grouped and can be completed in this fashion: `grouped.transform`<br>
>> c. __Filtration:__ Filtration returns a subset of the original object and can be completed in this fashion: `grouped.filter`<br>
>> d. __Other:__ `grouped.count`, `grouped.cummax`, `grouped.cumsum`, `grouped.fillna`, `grouped.max`, etc. 

__Helpful Points:__
1. GroupBy objects have a few useful attributes for analyzing the groups that were created:
> 1. The `groups` attribute to view the groups that were created: `df.groupby(key).groups`
> 2. The `describe` attribute to view information about the groups that were created: `df.groupby(key).describe()`
> 3. The `ngroups` attribute to view the number of groups that were created: `df.groupby(key).ngroups`
> 4. The `first` attribute to view the first few rows of the groups that were created: `df.groupby(key).first()`
> 5. The `last` attribute to view the last few rows of the groups that were created: `df.groupby(key).last()`
> 6. The `get_group` attribute to access one of the many groups that were created:`df.groupby(key).get_group()`
2. Remember you can always see a complete list of all the attributes of an object by selecting `obj.<TAB>`

__Practice:__ Examples of GroupBy in Pandas in Python

#### Part 1 (Step 1 - Split):

In [47]:
department_df = pd.DataFrame({'Department' : ['Marketing', 'HR', 'Marketing', 'HR',
                           'Marketing', 'HR', 'Marketing', 'Marketing'],
                   'City' : ['Chicago', 'Olympia', 'Seattle', 'New York',
                           'Seattle', 'Seattle', 'Pittsburgh', 'New York'],
                   'People' : [100, 20, 31, 300,
                           1000, 300, 450, 5],
                   'Revenue' :[200, 200, 31, 350,
                           1200, 300, 4050, 50]}, columns = ["Department", "City", "People", "Revenue"])

In [48]:
department_df

  Department        City  People  Revenue
0  Marketing     Chicago     100      200
1         HR     Olympia      20      200
2  Marketing     Seattle      31       31
3         HR    New York     300      350
4  Marketing     Seattle    1000     1200
5         HR     Seattle     300      300
6  Marketing  Pittsburgh     450     4050
7  Marketing    New York       5       50

##### Example 1.1 (Group by Department):

In [49]:
grouped_dpt = department_df.groupby('Department')
grouped_dpt # groupby object

##### Example 1.2 (Attributes of GroupBy Object):

In [50]:
grouped_dpt.groups # groups

{'HR': Int64Index([1, 3, 5], dtype='int64'),
 'Marketing': Int64Index([0, 2, 4, 6, 7], dtype='int64')}

In [51]:
grouped_dpt.describe() # summary statistics

           People                                                             \
            count        mean         std   min    25%    50%    75%     max
Department
HR            3.0  206.666667  161.658075  20.0  160.0  300.0  300.0   300.0
Marketing     5.0  317.200000  421.428167   5.0   31.0  100.0  450.0  1000.0

           Revenue                                                         \
             count         mean          std    min    25%    50%     75%
Department
HR             3.0   283.333333    76.376262  200.0  250.0  300.0   325.0
Marketing      5.0  1106.200000  1715.194508   31.0   50.0  200.0  1200.0


               max
Department
HR           350.0
Marketing   4050.0

In [52]:
grouped_dpt.ngroups # number of groups

2

In [53]:
grouped_dpt.first() # first row of each group

               City  People  Revenue
Department
HR          Olympia      20      200
Marketing   Chicago     100      200

In [54]:
grouped_dpt.head(1)

  Department     City  People  Revenue
0  Marketing  Chicago     100      200
1         HR  Olympia      20      200

In [55]:
grouped_dpt.last() # last row of each group

                City  People  Revenue
Department
HR           Seattle     300      300
Marketing   New York       5       50

In [56]:
grouped_dpt.tail(1)

  Department      City  People  Revenue
5         HR   Seattle     300      300
7  Marketing  New York       5       50

In [57]:
grouped_dpt.nth(2) # nth row

               City  People  Revenue
Department
HR          Seattle     300      300
Marketing   Seattle    1000     1200

##### Example 1.3 (Group by City):

In [58]:
grouped_city = department_df.groupby('City')
grouped_city # groupby object

In [59]:
grouped_dpt["City"]

In [60]:
grouped_dpt.get_group("HR") # get one group

       City  People  Revenue
1   Olympia      20      200
3  New York     300      350
5   Seattle     300      300

#### Part 2 (Step 2 - Apply):

In [61]:
department_df

  Department        City  People  Revenue
0  Marketing     Chicago     100      200
1         HR     Olympia      20      200
2  Marketing     Seattle      31       31
3         HR    New York     300      350
4  Marketing     Seattle    1000     1200
5         HR     Seattle     300      300
6  Marketing  Pittsburgh     450     4050
7  Marketing    New York       5       50

#### Part 2.1 (Aggregation):

##### Example 2.1.1 (Aggregate by Sum):

In [62]:
grouped_dpt.aggregate(np.sum) # aggregate sum based on one group

            People  Revenue
Department
HR             620      850
Marketing     1586     5531

In [63]:
grouped_dpt.agg(np.sum) # note: we can also just write agg instead of aggregate

            People  Revenue
Department
HR             620      850
Marketing     1586     5531

In [64]:
department_df.groupby("Department", as_index = False).sum() # if we want the group keys as a column and not index

  Department  People  Revenue
0         HR     620      850
1  Marketing    1586     5531

In [65]:
# new groupby object by department AND city
grouped_dpt_city = department_df.groupby(["Department", "City"])

In [66]:
grouped_dpt_city.aggregate(np.sum) # aggregate sum based on two groups

                       People  Revenue
Department City
HR         New York       300      350
           Olympia         20      200
           Seattle        300      300
Marketing  Chicago        100      200
           New York         5       50
           Pittsburgh     450     4050
           Seattle       1031     1231

The above is actually an example of "multiple keys" since we have both "Department" and "City" as Keys and therefore the result is a __[MultiIndex](http://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced-hierarchical) or Hierarchical Index__ which is not covered in this course. We can avoid this by making the group keys both into columns like we did above:

In [67]:
department_df.groupby(["Department", "City"], as_index = False).sum()

  Department        City  People  Revenue
0         HR    New York     300      350
1         HR     Olympia      20      200
2         HR     Seattle     300      300
3  Marketing     Chicago     100      200
4  Marketing    New York       5       50
5  Marketing  Pittsburgh     450     4050
6  Marketing     Seattle    1031     1231

##### Example 2.1.2 (Aggregate by Mean):

In [68]:
grouped_dpt.aggregate(np.mean) # means based on one group

                People      Revenue
Department
HR          206.666667   283.333333
Marketing   317.200000  1106.200000

In [69]:
grouped_dpt_city.aggregate(np.mean) # means based on two groups

                       People  Revenue
Department City
HR         New York     300.0    350.0
           Olympia       20.0    200.0
           Seattle      300.0    300.0
Marketing  Chicago      100.0    200.0
           New York       5.0     50.0
           Pittsburgh   450.0   4050.0
           Seattle      515.5    615.5

##### Example 2.1.3 (Aggregate by Sizes):

In [70]:
grouped_dpt.size()

Department
HR           3
Marketing    5
dtype: int64

In [71]:
grouped_dpt_city.size()

Department  City
HR          New York      1
            Olympia       1
            Seattle       1
Marketing   Chicago       1
            New York      1
            Pittsburgh    1
            Seattle       2
dtype: int64

##### Example 2.1.4 (Aggregate by Multiple Functions):

In [72]:
grouped_dpt.aggregate([np.sum, np.mean, np.std]) # this is similar to describe() above

           People                         Revenue
              sum        mean         std     sum         mean          std
Department
HR            620  206.666667  161.658075     850   283.333333    76.376262
Marketing    1586  317.200000  421.428167    5531  1106.200000  1715.194508

#### Part 2.2 (Transformation):

In [73]:
department_df

  Department        City  People  Revenue
0  Marketing     Chicago     100      200
1         HR     Olympia      20      200
2  Marketing     Seattle      31       31
3         HR    New York     300      350
4  Marketing     Seattle    1000     1200
5         HR     Seattle     300      300
6  Marketing  Pittsburgh     450     4050
7  Marketing    New York       5       50

##### Example 2.2.1 (Transform to Sum of Groups):

In [74]:
department_df["Revenue_Total"] = grouped_dpt["Revenue"].transform('sum') # transform revenue to be total departmental revenue
department_df

  Department        City  People  Revenue  Revenue_Total
0  Marketing     Chicago     100      200           5531
1         HR     Olympia      20      200            850
2  Marketing     Seattle      31       31           5531
3         HR    New York     300      350            850
4  Marketing     Seattle    1000     1200           5531
5         HR     Seattle     300      300            850
6  Marketing  Pittsburgh     450     4050           5531
7  Marketing    New York       5       50           5531

##### Example 2.2.2 (Transform to Z-Score of Groups):

We can also use a manual function inside the transform argument. In this case, we are using a function that calculates the __["Z-Score"](https://en.wikipedia.org/wiki/Standard_score)__ which is a standardized measure that is calculated by subtracting the mean from every value and dividing this by the standard deviation. We will see this in more detail in Lectures 11 and 12.  

- Don't worry about the definition of Z-Score here. The point of this example is not to teach the Z-Score, but to see how we can apply a manual function to each group and transform the values
- The most important thing to note here is that the function is being applied WITHIN groups only. See calculation for "Standardized_Revenue" for the Marketing Department in Chicago:

Group Mean across all Marketing Departments: $1106.2$<br>
Group Standard Deviation across all Marketing Departments: $1715.2$<br>
Z-Score for Marketing-Chicago: $(200 - 1106.2)/1715.2 = -0.528$

In [75]:
zscore = lambda x: (x-x.mean()) / x.std()
zscore

In [76]:
department_df["Standardized_Revenue"] = grouped_dpt["Revenue"].transform(zscore) # transform revenue to be total departmental revenue
department_df

  Department        City  People  Revenue  Revenue_Total  Standardized_Revenue
0  Marketing     Chicago     100      200           5531             -0.528337
1         HR     Olympia      20      200            850             -1.091089
2  Marketing     Seattle      31       31           5531             -0.626868
3         HR    New York     300      350            850              0.872872
4  Marketing     Seattle    1000     1200           5531              0.054688
5         HR     Seattle     300      300            850              0.218218
6  Marketing  Pittsburgh     450     4050           5531              1.716307
7  Marketing    New York       5       50           5531             -0.615790

##### Example 2.2.3 (Transform to Range):

In [77]:
department_df["Revenue_Range"] = grouped_dpt["Revenue"].transform('max') - grouped_dpt["Revenue"].transform('min') 
department_df

,Department,City,People,Revenue,Revenue_Total,Standardized_Revenue,Revenue_Range
0,Marketing,Chicago,100,200,5531,-0.528337,4019
1,HR,Olympia,20,200,850,-1.091089,150
2,Marketing,Seattle,31,31,5531,-0.626868,4019
3,HR,New York,300,350,850,0.872872,150
4,Marketing,Seattle,1000,1200,5531,0.054688,4019
5,HR,Seattle,300,300,850,0.218218,150
6,Marketing,Pittsburgh,450,4050,5531,1.716307,4019
7,Marketing,New York,5,50,5531,-0.615790,4019

Note: NOT shown here is an application of replacing missing data with group mean values. Since the transform method is applied WITHIN groups, we can impute missing data with the group mean value that observation belongs to.

#### Part 2.3 (Filtration):

Recall in Lecture 4 our discussion of the `map`, `reduce`, and `filter` functions that were used in conjunction with `lambda` functions. Here is no different except we are applying the function WITHIN groups

##### Example 2.3.1 (Subset - 1):

In [78]:
# take only elements that belong to groups with a group sum greater than 100
grouped_dpt["Revenue"].filter(lambda x: x.sum() > 1000)

0     200
2      31
4    1200
6    4050
7      50
Name: Revenue, dtype: int64

This returns all the elements from the Marketing group since this was the only group that had a sum greater than 1000

##### Example 2.3.2 (Subset - 2):

In [79]:
# take only elements that belong to groups that have less than 5 members
grouped_dpt["Revenue"].filter(lambda x: len(x) < 5)

1    200
3    350
5    300
Name: Revenue, dtype: int64

This returns all the elements from the HR group since this was the only group that had less than 5 members

### 5.1.5 Operations on Pandas Data Structures:

### 5.1.5.1 Operations on Elements, Rows, and Columns:

__Overview:__
- Pandas offers various ways to operate on Series and DataFrames in both a row/column fashion (i.e. vectorized) and an element-wise fashion
- Operations can be broken down into the following two types:
> 1. __Operations with Loops:__ There are 2 main types of loop in Pandas Data Structures:
>> a. __Looping over Rows:__ To loop over rows, it is possible to use the functions __[`df.itertuples`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.itertuples.html)__ (which iterates over DataFrame rows as namedtuples of the values) or __[`df.iterrows`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.iterrows.html)__ (which iterates over (column, Series) pairs <br>
>> b. __Looping over Columns:__ To loop over columns, it is possible to use the functions __[`df.iteritems`](http://pandas.pydata.org/pandas-docs/version/0.17.0/generated/pandas.DataFrame.iteritems.html)__
> 2. __Operations without Loops:__ There are 3 main types of functions that are used to perform operations without loops:
>> a. __[`apply`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.apply.html):__ The `apply` function works on a row/column basis on `DataFrame` objects. The syntax is as follows: `df.apply(func, axis=0)`, where the `axis=0` is to apply function over each column and `axis=1` is to apply function over each row<br> 
>> b. __[`map`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.map.html):__ The `map` function works on an elment-wise basis on `Series` objects. The syntax is as follows: `s.map(arg)` where `arg` can be a function, dictionary or series<br>
>> c. __[`applymap`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.applymap.html):__ The `applymap` function works on an element-wise basis on `DataFrame` objects. The syntax is as follows: `df.applymap(func)`

__Helpful Points:__
1. Some users have expressed discontent and overall discouragement over using `df.iterrows` to iterate over rows of a DataFrame in favour of vectorized solutions (see Operations without Loops above) OR `df.itertuples`. You can read about some of `df.iterrows` performance concerns [here](https://stackoverflow.com/questions/24870953/does-iterrows-have-performance-issues) if you are interested 
2. In each case of the operations without loops, the function that may be entered in as an argument can be a manually made one using the `lambda` expression or a function that is supported by NumPy in the form of `np.func`

__Practice:__ Examples of Operations on Elements, Rows, and Columns on Pandas Data Structures in Python

#### Part 1 (Operations with Loops):

In [80]:
my_df_small = pd.DataFrame(np.arange(10))
my_df_large = pd.DataFrame(np.arange(100000))

In [81]:
my_df_small.head()

   0
0  0
1  1
2  2
3  3
4  4

##### Example 1.1 (Looping over Rows - Iterrows):

In [82]:
for row in my_df_small.iterrows():
    print(row)

(0, 0    0
Name: 0, dtype: int64)
(1, 0    1
Name: 1, dtype: int64)
(2, 0    2
Name: 2, dtype: int64)
(3, 0    3
Name: 3, dtype: int64)
(4, 0    4
Name: 4, dtype: int64)
(5, 0    5
Name: 5, dtype: int64)
(6, 0    6
Name: 6, dtype: int64)
(7, 0    7
Name: 7, dtype: int64)
(8, 0    8
Name: 8, dtype: int64)
(9, 0    9
Name: 9, dtype: int64)

The function `iterrows()` iterates over DataFrame rows as (index, Series) pairs. For example:

1. The first (index, Series) pairs is `(0, 0   0)` which refers to the `0` index (first row) and the Series object which is the column name (`0`) and the value `0`
2. The seconds (index, Series) pairs is `(1, 0   0)` which refers to the `1` index (second row) and the Series object which is the column name (`0`) and the value `1`

In [83]:
#%%timeit 

# for row in my_df_large.iterrows():
#    pass

### Getting some sort of error when this runs. Not sure why.

##### Example 1.2 (Looping over Rows - Itertuples):

In [84]:
for row in my_df_small.itertuples():
    print(row)

Pandas(Index=0, _1=0)
Pandas(Index=1, _1=1)
Pandas(Index=2, _1=2)
Pandas(Index=3, _1=3)
Pandas(Index=4, _1=4)
Pandas(Index=5, _1=5)
Pandas(Index=6, _1=6)
Pandas(Index=7, _1=7)
Pandas(Index=8, _1=8)
Pandas(Index=9, _1=9)

The function `itertuples()` iterates over DataFrame rows as namedtuples. For example:

1. The first namedtuple is `(Index=0, _1=0)` which refers to the tuple that contains the `Index=0` and `_1` which refers to the name of the column and the value in that column (`0`)
2. The second namedtuple is `(Index=1, _1=1)` which refers to the tuple that contains the `Index=1` and `_1` which refers to the name of the column and the value in that column (`1`)

In [85]:
#%%timeit

for row in my_df_large.itertuples():
    pass

### %timeit seems to be having issues. no time to figure out why.

Compare this time result using `itertuples()` with the time result above using `iterrows()`. The mean time of `itertuples()` was 44.8 ms per loop compared to `iterrows()` which was over 3 seconds!!

##### Example 1.3 (Looping over Columns - Iteritems):

In [86]:
my_df_small_T = my_df_small.T
my_df_large_T = my_df_large.T

In [87]:
my_df_small_T

   0  1  2  3  4  5  6  7  8  9
0  0  1  2  3  4  5  6  7  8  9

In [88]:
for col in my_df_small_T.iteritems():
    print(col)

(0, 0    0
Name: 0, dtype: int64)
(1, 0    1
Name: 1, dtype: int64)
(2, 0    2
Name: 2, dtype: int64)
(3, 0    3
Name: 3, dtype: int64)
(4, 0    4
Name: 4, dtype: int64)
(5, 0    5
Name: 5, dtype: int64)
(6, 0    6
Name: 6, dtype: int64)
(7, 0    7
Name: 7, dtype: int64)
(8, 0    8
Name: 8, dtype: int64)
(9, 0    9
Name: 9, dtype: int64)

Same format as `df.iterrows()` above

#### Part 2 (Operations without Loops):

In [89]:
department_df_sub = department_df.loc[:, ["People", "Revenue"]]
revenue = department_df["Revenue"]

In [90]:
department_df_sub

   People  Revenue
0     100      200
1      20      200
2      31       31
3     300      350
4    1000     1200
5     300      300
6     450     4050
7       5       50

In [91]:
revenue

0     200
1     200
2      31
3     350
4    1200
5     300
6    4050
7      50
Name: Revenue, dtype: int64

##### Example 2.1 (Operations without Loops - Apply):

##### Example 2.1.1 (Sum):

In [92]:
department_df_sub.apply(np.sum, axis = 0) # apply function to each column

People     2206
Revenue    6381
dtype: int64

In [93]:
department_df_sub.sum(axis = 0) # non-apply equivalent

People     2206
Revenue    6381
dtype: int64

In [94]:
department_df_sub.apply(np.sum, axis = 1)# apply function to each row

0     300
1     220
2      62
3     650
4    2200
5     600
6    4500
7      55
dtype: int64

In [95]:
department_df_sub.sum(axis = 1)

0     300
1     220
2      62
3     650
4    2200
5     600
6    4500
7      55
dtype: int64

##### Example 2.1.2 (Range):

In [96]:
department_df_sub.apply(lambda x: x.max() - x.min()) # apply function to each column

People      995
Revenue    4019
dtype: int64

##### Example 2.2 (Operations without Loops - Map):

In [97]:
revenue.map(lambda x: '%.2f' % x) # insert 2 decimal places for each element in the Series

0     200.00
1     200.00
2      31.00
3     350.00
4    1200.00
5     300.00
6    4050.00
7      50.00
Name: Revenue, dtype: object

##### Example 2.3 (Operations without Loops - Applymap):

In [98]:
department_df_sub.applymap(lambda x: '%.2f' % x) # insert 2 decimal places for each element in the Series

    People  Revenue
0   100.00   200.00
1    20.00   200.00
2    31.00    31.00
3   300.00   350.00
4  1000.00  1200.00
5   300.00   300.00
6   450.00  4050.00
7     5.00    50.00

### 5.1.5.2 Operations to Handle Missing Data in Pandas Data Structures:

__Overview:__
- In Data Science, when working with real-world data, it is very common to encounter missing data that may be a result of data not available, data not recorded, or data not present for some reason
- Since the purpose of this course is not teach tools for analyzing data, per se, we won't cover handling missing data in too much detail
- However, as a beginner you should be aware of the possibile options that Pandas provides for storing missing data, finding missing data, inserting missing data, and cleaning/filling missing data which can be read about in detail [here](http://pandas.pydata.org/pandas-docs/stable/missing_data.html) and explained below:

> 1. __Storing Missing Data:__ The value `NaN` is the default missing value marker, but sometimes `None` is used as well 
> 2. __Finding Missing Data:__ Pandas offers many convenient functions for testing if values are missing such as: `df.isna()`, `df.notna()`, `df.isnull()`, `df.notnull()` which all return a boolean same-sized object indicating if the values are missing. It is also possible to use these functions to count the number of missing values (i.e. `np.count_nonzero(df.isnull())`, `np.count_nonzero(np.any(df.isnull(), axis=)`)
> 3. __Inserting Missing Data:__ It is possible to insert a missing value by setting values in Series or DataFrame objects as `None` or `np.nan`
> 4. __Cleaning/Filling Missing Data:__ Pandas offers many convenient functions for filling missing values such as: `df.fillna(value)` and `df.dropna(axis)`

__Helpful Points:__
1. Note two `NaN` values do not compare equal (i.e. `np.nan == np.nan` is evaluated as `False`)

__Practice:__ Examples of Operations to Handle Missing Data in Pandas Data Structures in Python

In [99]:
na_df = df = pd.DataFrame(np.arange(15).reshape(5, 3), index=['a', 'c', 'e', 'f', 'h'],
                          columns=['one', 'two', 'three'])
na_df = na_df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
na_df

    one   two  three
a   0.0   1.0    2.0
b   NaN   NaN    NaN
c   3.0   4.0    5.0
d   NaN   NaN    NaN
e   6.0   7.0    8.0
f   9.0  10.0   11.0
g   NaN   NaN    NaN
h  12.0  13.0   14.0

#### Part 1 (Finding Missing Data):

##### Example 1.1 (Finding Missing Data - Method 1):

Newer versions of pandas!

In [100]:
na_df.isna() # check elements that are missing

     one    two  three
a  False  False  False
b   True   True   True
c  False  False  False
d   True   True   True
e  False  False  False
f  False  False  False
g   True   True   True
h  False  False  False

In [101]:
na_df.notna() # check elements that are not missing

     one    two  three
a   True   True   True
b  False  False  False
c   True   True   True
d  False  False  False
e   True   True   True
f   True   True   True
g  False  False  False
h   True   True   True

##### Example 1.2 (Finding Missing Data - Method 2):

In [102]:
na_df.isnull() # check elements that are missing

     one    two  three
a  False  False  False
b   True   True   True
c  False  False  False
d   True   True   True
e  False  False  False
f  False  False  False
g   True   True   True
h  False  False  False

In [103]:
na_df.notnull() # check elements that are not missing

     one    two  three
a   True   True   True
b  False  False  False
c   True   True   True
d  False  False  False
e   True   True   True
f   True   True   True
g  False  False  False
h   True   True   True

##### Example 1.3 (Finding Missing Data - Method 3):

In [104]:
np.count_nonzero(na_df.isnull()) # total number of missing values

9

In [105]:
np.count_nonzero(np.any(na_df.isnull(), axis=0)) # total number of columns with missing values

3

In [106]:
np.count_nonzero(np.any(na_df.isnull(), axis=1)) # total number of rows with missing values

3

#### Part 2 (Inserting Missing Data):

In [107]:
na_df["four"] = "Allen"
na_df

    one   two  three   four
a   0.0   1.0    2.0  Allen
b   NaN   NaN    NaN  Allen
c   3.0   4.0    5.0  Allen
d   NaN   NaN    NaN  Allen
e   6.0   7.0    8.0  Allen
f   9.0  10.0   11.0  Allen
g   NaN   NaN    NaN  Allen
h  12.0  13.0   14.0  Allen

##### Example 2.1 (Inserting Missing Data into Int):

In [108]:
na_df.loc["a", "two"] = None # fills as NaN since replacing an int
na_df.loc["a", "three"] = np.nan # fills as NaN 
na_df

    one   two  three   four
a   0.0   NaN    NaN  Allen
b   NaN   NaN    NaN  Allen
c   3.0   4.0    5.0  Allen
d   NaN   NaN    NaN  Allen
e   6.0   7.0    8.0  Allen
f   9.0  10.0   11.0  Allen
g   NaN   NaN    NaN  Allen
h  12.0  13.0   14.0  Allen

##### Example 2.2 (Inserting Missing Data into Int):

In [109]:
na_df.loc["a", "four"] = np.nan # fills as None since replacing a str
na_df.loc["b", "four"] = None # fills as None
na_df

    one   two  three   four
a   0.0   NaN    NaN    NaN
b   NaN   NaN    NaN   None
c   3.0   4.0    5.0  Allen
d   NaN   NaN    NaN  Allen
e   6.0   7.0    8.0  Allen
f   9.0  10.0   11.0  Allen
g   NaN   NaN    NaN  Allen
h  12.0  13.0   14.0  Allen

#### Part 3 (Cleaning/Filling Missing Data):

##### Example 3.1 (Filling NA with Value):

In [110]:
na_df.fillna("NEW")

   one  two three   four
a    0  NEW   NEW    NEW
b  NEW  NEW   NEW    NEW
c    3    4     5  Allen
d  NEW  NEW   NEW  Allen
e    6    7     8  Allen
f    9   10    11  Allen
g  NEW  NEW   NEW  Allen
h   12   13    14  Allen

##### Example 3.2 (Dropping Axis Labels with Missing Values):

In [111]:
na_df

    one   two  three   four
a   0.0   NaN    NaN    NaN
b   NaN   NaN    NaN   None
c   3.0   4.0    5.0  Allen
d   NaN   NaN    NaN  Allen
e   6.0   7.0    8.0  Allen
f   9.0  10.0   11.0  Allen
g   NaN   NaN    NaN  Allen
h  12.0  13.0   14.0  Allen

In [112]:
na_df.dropna(axis=0) # remove rows that have NA values

    one   two  three   four
c   3.0   4.0    5.0  Allen
e   6.0   7.0    8.0  Allen
f   9.0  10.0   11.0  Allen
h  12.0  13.0   14.0  Allen

### 5.1.5.3 Operations to Handle Time Series Data in Pandas Data Structures:

__Overview:__
- As a Data Scientist, it is common to encounter data that takes place over time (i.e. sales data, financial data, etc.) which are commonly known as __[Time Series](https://en.wikipedia.org/wiki/Time_series)__ Data 
- Recall in out early discussions about the usefulness of Pandas and one of the major points we outlined which was Pandas' Time Series extensive capabilities which can be read about in detail [here](https://pandas.pydata.org/pandas-docs/stable/timeseries.html)
- We will only briefly explore Pandas Time Series/Dates functionality here as they pertain to:
> 1. Initiating objects of the following Date-Time types:
>> a. `Timestamp` (single timestamp): created by `pd.to_datetime()`, `pd.Timestamp`<br>
>> b. `DatetimeIndex` (index of `Timestamp`): created by `pd.datetime()`, `pd.date_range()`, `pd.DatetimeIndex`<br>
>> c. `Period` (single time span): created by `pd.Period`<br>
>> d. `PeriodIndex` (index of `Period`): created by `pd.period_range`, `pd.PeriodIndex`
> 2. Common operations:
>> a. `df.shift()`: Shifts index by desired number of periods<br> 
>> b. `df.resample()`: Resampling operations during frequency conversion (i.e. converting secondly data into 5-minutely data). It operates as time-based GroupBy (see above)<br>
>> c. `df.rolling()`: Provides rolling window calculations 

__Helpful Points:__
1. Pandas Time Series capabilities leverage the NumPy `datetime64` and `timedelta54` dtypes and you will find these as the type of the object after initializing a Timestamp, Period, etc.

#### Part 1 (Initiating Objects):

In [113]:
from datetime import datetime

##### Example 1.1 (Initiating Timestamp):

##### Example 1.1.1 (Using `pd.Timestamp()`):

In [114]:
pd.Timestamp("2018-04-23")

Timestamp('2018-04-23 00:00:00')

In [115]:
pd.Timestamp(2018, 4, 23)

Timestamp('2018-04-23 00:00:00')

##### Example 1.1.2 (Using `pd.to_datetime()`):

In [116]:
pd.to_datetime("2018/04/23")

Timestamp('2018-04-23 00:00:00')

##### Example 1.2 (Initiating DatetimeIndex):

##### Example 1.2.1 (Using `pd.date_range()`):

In [117]:
first_week = pd.date_range("2018/04/23", periods = 7, freq = "D") # first week of class 
first_week

DatetimeIndex(['2018-04-23', '2018-04-24', '2018-04-25', '2018-04-26',
               '2018-04-27', '2018-04-28', '2018-04-29'],
              dtype='datetime64[ns]', freq='D')

In [118]:
first_week_day_num = pd.Series(np.arange(1,8), index = first_week)
first_week_day_num

2018-04-23    1
2018-04-24    2
2018-04-25    3
2018-04-26    4
2018-04-27    5
2018-04-28    6
2018-04-29    7
Freq: D, dtype: int64

In [119]:
converted_first_week = first_week_day_num.asfreq("B") # class only happens on business days 
converted_first_week

2018-04-23    1
2018-04-24    2
2018-04-25    3
2018-04-26    4
2018-04-27    5
Freq: B, dtype: int64

See [here](http://pandas.pydata.org/pandas-docs/stable/timeseries.html#offset-aliases) for the possible time series frequencies that can be used and their Pandas Aliases.

##### Example 1.3 (Initiating Period):

##### Example 1.3.1 (Using `pd.Period()`):

In [120]:
pd.Period("2018-04") # inferred as Month

Period('2018-04', 'M')

In [121]:
pd.Period("2018-04-23") # inferred as Day

Period('2018-04-23', 'D')

##### Example 1.4 (Initiating PeriodIndex):

##### Example 1.4.1 (Using `pd.period_range()`):

In [122]:
pd.period_range(start="2018-04-23", end = "May-31-2018", freq = "M")

PeriodIndex(['2018-04', '2018-05'], dtype='period[M]', freq='M')

#### Part 2 (Common Operations):

##### Example 2.1 (Using Shift):

In [123]:
converted_first_week

2018-04-23    1
2018-04-24    2
2018-04-25    3
2018-04-26    4
2018-04-27    5
Freq: B, dtype: int64

In [124]:
converted_first_week.shift(2) # shift values by 2 periods

2018-04-23    NaN
2018-04-24    NaN
2018-04-25    1.0
2018-04-26    2.0
2018-04-27    3.0
Freq: B, dtype: float64

##### Example 2.2 (Using Resample):

In [125]:
rng = pd.date_range('4/23/2018', periods=100, freq='S') # range of 100 seconds
ts = pd.Series(np.arange(len(rng)), index = rng) # fill in values of 0 - 100
ts.head()

2018-04-23 00:00:00    0
2018-04-23 00:00:01    1
2018-04-23 00:00:02    2
2018-04-23 00:00:03    3
2018-04-23 00:00:04    4
Freq: S, dtype: int64

In [126]:
ts.resample("Min").sum() # 1 minute totals

2018-04-23 00:00:00    1770
2018-04-23 00:01:00    3180
Freq: T, dtype: int64

##### Example 2.3 (Using Rolling):

In [127]:
df = pd.DataFrame({'Counts': [10, 31, 42, 5, 1, np.nan]})
df

   Counts
0    10.0
1    31.0
2    42.0
3     5.0
4     1.0
5     NaN

In [128]:
df.rolling(2).sum() # rolling sum with window length of 2 (sum of every 2 values) - ignored NaN

   Counts
0     NaN
1    41.0
2    73.0
3    47.0
4     6.0
5     NaN

In [129]:
df.rolling(window = 2, min_periods = 1).sum() # rolling sum with window length of 2 (sum of every 2 values) - adds if there is at least 1 value in the window

   Counts
0    10.0
1    41.0
2    73.0
3    47.0
4     6.0
5     1.0